package ZPOS;

our $VERSION = '0.1';

1;

__END__

=cut

===> : 请求过程
<--- : 应答过程
             
                (NACD操作系统进程)               (Ztran交易处理-操作系统进程)
                每个NACD对接一个NAC                     有N个进程
              ---------------------                --------------------
              |                   |                |                  |
              |--------------     |                |--------          |     
    =packet==>|on_nac_packet|.....|=====$packet===>|on_nacd|..........|===packet==>
              |--------------     |                |--------          |
    与NAC异步 |                   |                |                  |    同步调用zero
              |  -----------------|                |         ---------|
    <-packet--|..|on_tran_packet..|<----$packet----|.........|on_zero |<--packet---
              |  -----------------|                |         ---------|
              |                   |                |                  |
              |                   |                |                  |
        |-------------------------------|      |-----------------------------|
        |          POE Kernel           |      |         POE Kernel          |
        |-------------------------------|      |-----------------------------|
    
=back
    
    
    
    
    
