#!/usr/bin/perl
use strict;
use warnings;
use Zeta::Run;
use DBI;
use Carp;
use POE;

use constant{
    DEBUG => $ENV{ZPOS_DEBUG} || 0,
};

BEGIN {
    require Data::Dump if DEBUG;
}

#
# $name  :  nacd所服务的地区名称(head east nc ne nw ...)
#
sub {

    my @name = @_;   # 需要被模拟的nac

    # 获取配置与日志
    my $zcfg = zkernel->zconfig();
    my $logger = zlogger;

    # 启动 - nacd
    for (@name) {
        POE::Session->create(
            inline_states  => {
                _start => sub {
                     $zcfg->{nacd}{$name}->spawn($zcfg, $logger);
                },
            },
        );
    }

    # 运行
    $poe_kernel->run();

    exit 0;
};

__END__

nac模拟器  :  异步转同步

1>  收到POS报文, 发送POSP
2>  收到POSP报文, 发送POS

                                  <<系统结构图>>
           同步-异步        异步-同步           同步-同步
             -----        ------------        ------------
-------      | N |        |          |        |          |                      ------------
| pos |----->| A |<------>| POSP系统 |------->|          |--------------------->| 银行POSP |
-------      | C |        |          |        |          |                      ------------
             -----        ------------        |          |      同步-异步   
                                              |          |     ------------     ------------
                                              |          |---->| 银行前置 |<--->| 银行机构 |
                                              |          |     ------------     ------------
                                              |          |
                                              |          |      同步-同步 
                                              |          |     ------------     ------------ 
             -----        ------------        |    交    |---->| 银行前置 |---->| 银行机构 | 
-------      | N |        |          |        |    易    |     ------------     ------------ 
| pos |----->| A |<------>| POSP系统 |------->|    系    |
-------      | C |        |          |        |    统    |                      ------------  
             -----        ------------        |          |--------------------->| 银行POSP |
                                              |          |                      ------------
                          ------------        |          |
                          |          |        |          |
                          | 外部POSP |------->|          |                      ------------   
                          |          |        |          |--------------------->| 银行POSP | 
                          ------------        |          |                      ------------   
                          ------------        |          |
                          |          |        |          |                      ------------   
                          | 外部POSP |------->|          |--------------------->| 银行POSP | 
                          |          |        |          |                      ------------   
                          ------------        ------------
                                              

